/**
 *****************************************
 * Created by lifx
 * Created on 2018-05-15 18:01:35
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 加载依赖
 *****************************************
 */
import React from 'react';
import { render } from 'react-dom';
import App from './app';


/**
 *****************************************
 * 渲染【App】
 *****************************************
 */
render(<App />, document.getElementById('app'));


/**
 *****************************************
 * 启用热替换
 *****************************************
 */
if (module.hot) {
    module.hot.accept('./app', () => {
        render(<App />, document.getElementById('app'));
    });
}
